Documents/КонструкторУдостоверенияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>КонструкторУдостоверенияКачества</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.umk_НастройкиУдостоверенияКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияАльт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУдостоверенияКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ФормаУдостоверенияКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПодвала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодностиЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКопированияСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КонструкторУдостоверенияКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НомераСтраницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСтраницы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КатегорииПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.umk_КатегорияПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтраницы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СрокиГодности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.umk_СрокГодности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.umk_КатегорияПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сорт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оболочка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.umk_СрокГодности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.umk_КатегорияПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтраницы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/umk_НастройкиУдостоверенияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_НастройкиУдостоверенияКачества</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировкиКатегории</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаУдостоверенияКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ФормаУдостоверенияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_СрокГодности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_КатегорияПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оболочка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/КонструкторУдостоверенияКачества/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
		
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонструкторУдостоверенияКачества.Номер,
	|	КонструкторУдостоверенияКачества.Дата,
	|	КонструкторУдостоверенияКачества.Организация,
	|	КонструкторУдостоверенияКачества.Организация.Наименование КАК ОрганизацияНаименование,
	|	КонструкторУдостоверенияКачества.Организация.Наименование КАК ОрганизацияНаименование_,
	|	КонструкторУдостоверенияКачества.Ответственный
	|ИЗ
	|	Документ.КонструкторУдостоверенияКачества КАК КонструкторУдостоверенияКачества
	|ГДЕ
	|	КонструкторУдостоверенияКачества.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_umk_КонструкторУдостоверенияКачества";

	Макет = ПолучитьМакет("Удостоверение");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	
	СведенияО_Организации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата,,,КодЯзыкаПечать);

	ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьМакетаЗаголовок.Параметры.Заполнить(Шапка);
	
	Если ЗначениеЗаполнено(ОрганизацияАльт) тогда
		ОбластьМакетаЗаголовок.Параметры.ОрганизацияНаименование_ = ОрганизацияАльт
	КонецЕсли;
	
	
	// Банк
	Сведения = Новый Структура;
	Сведения.Вставить("НомерСчета",       СведенияО_Организации.НомерСчета);
	Сведения.Вставить("Банк",             СведенияО_Организации.Банк);
	Сведения.Вставить("МФО",              СведенияО_Организации.МФО);

	ОбластьМакетаЗаголовок.Параметры.БанковскиеРеквизиты = ФормированиеПечатныхФорм.ОписаниеОрганизации(Сведения, "НомерСчета,Банк,МФО",,КодЯзыкаПечать);
    ОбластьМакетаЗаголовок.Параметры.ЮрАдрес             = СведенияО_Организации.ЮридическийАдрес;
	ОбластьМакетаЗаголовок.Параметры.Телефон             = СведенияО_Организации.Телефоны;
	ОбластьМакетаЗаголовок.Параметры.ИНН                 = СведенияО_Организации.ИНН;
	ОбластьМакетаЗаголовок.Параметры.КодПоЕДРПОУ         = СведенияО_Организации.КодПоЕДРПОУ;
	ОбластьМакетаЗаголовок.Параметры.НомерСвидетельства  = СведенияО_Организации.НомерСвидетельства;
	
	//ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьМакетаШапка.Параметры.СрокГодностиЗаголовок = СрокГодностиЗаголовок; 
	
	//ТабДокумент.Вывести(ОбластьМакета);
	
		
	Регистратор = ЭтотОбъект.Ссылка;
		
	
	// Выборка по страницам
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.НомерСтраницы
		|ИЗ
		|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор = &Регистратор) КАК umk_НастройкиУдостоверенияКачестваСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.НомерСтраницы";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоСтраницам = РезультатЗапроса.Выбрать();
	
	ЭтоПерваяСтраница = Истина;
	
	НомерСтраницы = 1;
	нпп = 1;
	
	//Заголовок первой страницы
	ОбластьМакетаЗаголовок.Параметры.Страница = НомерСтраницы;
	ОбластьМакетаЗаголовок.Параметры.Страниц = ВыборкаПоСтраницам.Количество();
	ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
    ТабДокумент.Вывести(ОбластьМакетаШапка);

	
	Пока ВыборкаПоСтраницам.Следующий() Цикл   // Первый круг по номерам страниц
		
		Если Не НомерСтраницы =  ВыборкаПоСтраницам.НомерСтраницы 
			Тогда
			НомерСтраницы =  ВыборкаПоСтраницам.НомерСтраницы;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если Не НомерСтраницы = 1 Тогда  // Выведем заголовок на каждой странице
			ОбластьМакетаЗаголовок.Параметры.Страница = НомерСтраницы;
			ОбластьМакетаЗаголовок.Параметры.Страниц = ВыборкаПоСтраницам.Количество();
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			ТабДокумент.Вывести(ОбластьМакетаШапка);
		КонецЕсли;
	
	
	// Выбираем категории товаров
	
	ОбластьМакетаКатегория = Макет.ПолучитьОбласть("Категория");
	ОбластьСтрокаТаблицы   = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//нпп = 1;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.КатегорияПродукции КАК КатегорияПродукции,
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.ПорядокСортировкиКатегории КАК ПорядокСортировкиКатегории
		|ИЗ
		|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор = &Регистратор) КАК umk_НастройкиУдостоверенияКачестваСрезПоследних
		|ГДЕ
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.НомерСтраницы = &НомерСтраницы
		|
		|СГРУППИРОВАТЬ ПО
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.КатегорияПродукции,
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.ПорядокСортировкиКатегории
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСортировкиКатегории";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	Запрос.УстановитьПараметр("НомерСтраницы",НомерСтраницы);	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКатегории = РезультатЗапроса.Выбрать();
	
	//ЭтоПерваяСтраница = Истина;
	
	Пока ВыборкаКатегории.Следующий() Цикл
		//
		//Если Не НомерСтраницы =  ВыборкаПоТоварам.НомерСтраницы 
		//	Тогда
		//	ЭтоПерваяСтраница = Ложь;
		//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;

		
		ОбластьМакетаКатегория.Параметры.КатегорияПродукции = ВыборкаКатегории.КатегорияПродукции;
		
		ТабДокумент.Вывести(ОбластьМакетаКатегория); // Выводим область Категории товара
		
		// Группируем по сроку годности с отбором по категории
		
		Запрос = Новый Запрос;
	    Запрос.Текст = 
			"ВЫБРАТЬ
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.НаименованиеДляПечати КАК Наименование,
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Сорт,
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Оболочка,
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Номенклатура.Артикул КАК ДСТУ,
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.СрокГодности КАК СрокГодности,
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.ПорядокСортировки КАК ПорядокСортировки,
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.НомерСтраницы,
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Номенклатура
			|ИЗ
			|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И КатегорияПродукции = &КатегорияПродукции
			|				И Регистратор = &Регистратор) КАК umk_НастройкиУдостоверенияКачестваСрезПоследних
			|ГДЕ
			|	umk_НастройкиУдостоверенияКачестваСрезПоследних.НомерСтраницы = &НомерСтраницы
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядокСортировки
			|ИТОГИ ПО
			|	СрокГодности";
	
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("Период", Дата);
			Запрос.УстановитьПараметр("Регистратор",Регистратор);
			Запрос.УстановитьПараметр("КатегорияПродукции",
			                   ВыборкаКатегории.КатегорияПродукции);
			Запрос.УстановитьПараметр("НомерСтраницы",НомерСтраницы);				   
							   
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаПоСрокуГодности = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
							
			Пока ВыборкаПоСрокуГодности.Следующий() Цикл 
							
				ВысотаДоОбъединения = ТабДокумент.ВысотаТаблицы;
				
				ВысотаПослеОбъединения = ВысотаДоОбъединения;
				
				ВыборкаПоТоварам = ВыборкаПоСрокуГодности.Выбрать();
								
				
				Пока ВыборкаПоТоварам.Следующий() Цикл
					
					
					ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоТоварам);
					ОбластьСтрокаТаблицы.Параметры.ДатаИзготовления = ПолучитьДатуПартии(ВыборкаПоТоварам.Номенклатура);
					ОбластьСтрокаТаблицы.Параметры.нпп = нпп;
					ТабДокумент.Вывести(ОбластьСтрокаТаблицы);
					
					ВысотаПослеОбъединения = ВысотаПослеОбъединения + 1;	
					нпп = нпп + 1;
					
				//	НомерСтраницы =  ВыборкаПоТоварам.НомерСтраницы;
					
				КонецЦикла;
							
				ОбластьОбъединения = ТабДокумент.Область(ВысотаДоОбъединения +1 ,11, ВысотаПослеОбъединения,15);
				ОбластьОбъединения.Объединить();
				ОбластьОбъединения.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				ОбластьОбъединения.Текст = ВыборкаПоСрокуГодности.СрокГодности.ПредставлениеПечати;
				ОбластьОбъединения.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				ОбластьОбъединения.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
				ОбластьОбъединения.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Авто;
								
			КонецЦикла; // По сроку годности
	
		КонецЦикла; // По Категории
		
		
		Если НомерСтраницы%2 = 0 Или ВыборкаПоСтраницам.Количество() = НомерСтраницы  Тогда
			
			Если ВыборкаПоСтраницам.Количество() = НомерСтраницы Тогда
				
				ОбластьТекстПодвала = Макет.ПолучитьОбласть("СтрокаТестПодвала");
				ОбластьТекстПодвала.Параметры.ТекстПодвала = Регистратор.ТекстПодвала;
				ТабДокумент.Вывести(ОбластьТекстПодвала);
				
			КонецЕсли;
			
			ОбластьТекстПодписи = Макет.ПолучитьОбласть("Подписи");
			ОбластьТекстПодписи.Параметры.Ответственный = Ответственный.Наименование;
			ТабДокумент.Вывести(ОбластьТекстПодписи);
			
		КонецЕсли;

		
	КонецЦикла; // По Страницам
		
		
	//ОбластьСноски = Макет.ПолучитьОбласть("Сноски");
	//ТабДокумент.Вывести(ОбластьСноски);
	
		
		
	//ДанныеОтветственного = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация,Шапка.Ответственный.Физлицо, Шапка.Дата);

	//ОбластьТекстПодписи = Макет.ПолучитьОбласть("Подписи");
	//ОбластьТекстПодписи.Параметры.Ответственный = Ответственный.Наименование;
	//ТабДокумент.Вывести(ОбластьТекстПодписи);


	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

Функция ПолучитьДатуПартии(Номенклатура)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата КАК Дата,
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура = &Номенклатура
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата <= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата,
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	  Возврат Формат(Выборка.Дата, "ДФ=dd.MM.yyyy")
  Иначе
	  Возврат ""
	КонецЕсли;
		
	
КонецФункции


// Функция осуществляет запуск обработки формирующей печатную форму "Бланк товарного наполнения".
//
// Параметры:
//  НаПринтер - Булево. Если Истина, тогда печать выполняется непосредственно на принтер.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьБланк(НаПринтер)

	Обработки.ПечатьРаскладкиНоменклатурыПоМестамХранения.Создать().НапечататьИзДокумента(Ссылка, , , НаПринтер);

	Возврат Неопределено;

КонецФункции // ПечатьБланк()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Удостоверение" Тогда
		ТабДокумент = ПечатьДокумента();
	КонецЕсли;

	//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
     umk_Доработки.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка,,Истина,Ссылка);
	 
	
КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("Удостоверение"    , "Удостоверение качества");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// регистр НастройкиУдостоверенияКачества
	Движения.umk_НастройкиУдостоверенияКачества.Записывать = Истина;
	Движения.umk_НастройкиУдостоверенияКачества.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.umk_НастройкиУдостоверенияКачества.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ФормаУдостоверенияКачества = ФормаУдостоверенияКачества;
		Движение.СрокГодности = ТекСтрокаТовары.СрокГодности;
		Движение.КатегорияПродукции = ТекСтрокаТовары.КатегорияПродукции;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.НаименованиеДляПечати = ТекСтрокаТовары.НаименованиеДляПечати;
		Движение.Сорт = ТекСтрокаТовары.Сорт;
		Движение.Оболочка = ТекСтрокаТовары.Оболочка;
		Движение.НомерСтраницы = ТекСтрокаТовары.НомерСтраницы;
		ПорядокСортировки = ПолучитьПорядокСортировки(ТекСтрокаТовары);
		Движение.ПорядокСортировки = ПорядокСортировки;
		Движение.ПорядокСортировкиКатегории = ПолучитьПорядокСортировкиКатегории(ТекСтрокаТовары);
	КонецЦикла;
	
	//регистр  РеквизитыНоменклатурыУдостоверенияКачества
	
КонецПроцедуры // ОбработкаПроведения()

Функция ПолучитьПорядокСортировки(ТекСтрокаТовары)
	
	НомерСтраницы      = ТекСтрокаТовары.НомерСтраницы;
	КатегорияПродукции = ТекСтрокаТовары.КатегорияПродукции;
	СрокГодности       = ТекСтрокаТовары.СрокГодности;

	Параметр = Новый Структура("КатегорияПродукции",КатегорияПродукции);
	НайденнаяСтрокаКатегории = КатегорииПродукции.НайтиСтроки(Параметр);
	
	Если НайденнаяСтрокаКатегории.Количество() = 0 Тогда
		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Порядок сортировки не установлен: %1", КатегорияПродукции), СтатусСообщения.Важное);
		Возврат 0
	КонецЕсли;
		
	ПорядокКатегории = НайденнаяСтрокаКатегории[0].НомерСтроки;
	
	Параметр = Новый Структура("СрокГодности",СрокГодности);
	НайденнаяСтрокаКатегории = СрокиГодности.НайтиСтроки(Параметр);
	ПорядокСрокиГодности = НайденнаяСтрокаКатегории[0].НомерСтроки;
	
	ПорядокСрокиТовары  = ТекСтрокаТовары.НомерСтроки;
	
	Порядок =  Строка(НомерСтраницы) +  Строка(ПорядокКатегории) + Строка(ПорядокСрокиГодности)
	 + Строка(ПорядокСрокиТовары);
	
	Возврат Порядок 
		
КонецФункции

Функция ПолучитьПорядокСортировкиКатегории(ТекСтрокаТовары)
	
	
	КатегорияПродукции = ТекСтрокаТовары.КатегорияПродукции;
	

	Параметр = Новый Структура("КатегорияПродукции",КатегорияПродукции);
	НайденнаяСтрокаКатегории = КатегорииПродукции.НайтиСтроки(Параметр);
	
	Если НайденнаяСтрокаКатегории.Количество() = 0 Тогда
		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Порядок сортировки категории не установлен: %1", КатегорияПродукции), СтатусСообщения.Важное);
		Возврат 0
	КонецЕсли;
	
	ПорядокКатегории = НайденнаяСтрокаКатегории[0].НомерСтроки;
		
	Возврат ПорядокКатегории 
		
КонецФункции


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопированияСсылка = ОбъектКопирования.Ссылка;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры
